# DeleteMiddleBendNotAllowed Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..BendFailures..::..DeleteMiddleBendNotAllowed Property
BuiltInFailures..::..BendFailures Class See Also
---
Delete a middle bend in a bank is not allowed
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DeleteMiddleBendNotAllowed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DeleteMiddleBendNotAllowed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DeleteMiddleBendNotAllowed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..BendFailures Class
Autodesk.Revit.DB Namespace